Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
hookNormal:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
The normal should be perpendicular to the bar direction at the specified end of bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Normal hookNormal for end end isn't a valid normal for bar with index barPositionIndex
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
-or-
hookNormal has zero length.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018